"KLStringKerberosOperationFailed"        = "Kerberos Operation Failed:";
"KLStringLoginFailed"                    = "Kerberos Login Failed:";
"KLStringChangePasswordFailed"           = "Kerberos Change Password Failed:";
"KLStringOptionsChangeFailed"            = "Kerberos Options Change Failed:";
"KLStringPrompterFailed"                 = "Kerberos Prompt Failed:";
"KLStringKerberosOperationNotice"        = "Kerberos Operation:";
"KLStringLoginNotice"                    = "Kerberos Login:";
"KLStringChangePasswordNotice"           = "Kerberos Change Password:";
"KLStringOptionsChangeNotice"            = "Kerberos Options Change:";
"KLStringPrompterChangeNotice"           = "Kerberos Prompter:";
"KLStringUnknownError"                   = "Unknown error:";
"KLStringChangePasswordFor"              = "Change password for %s";
"KLStringPasswordExpired"                = "Your password has expired, would you like to change it?";
"KLStringYesOrNoAnswerOptions"           = "(yes/no)";
"KLStringYes"                            = "Yes";
"KLStringNo"                             = "No";
"KLStringOK"                             = "OK";
"KLStringCancel"                         = "Cancel";
"KLStringUnknownResponse"                = "%s is not a response I understand.  Please try again.";
"KLStringPasswordChanged"                = "Password for %s has been changed.";
"KLStringPasswordRejected"               = "New password rejected.";
"KLStringPasswordIncorrectCheckCapsLock" = "Password incorrect (check your Caps Lock key).";
"KLStringPasswordIncorrect"              = "Password incorrect.";
"KLStringClockSkewTooBig"                = "Clock skew too big.  Please check your time, time zone and daylight savings settings.";
"KLStringKaserverClockSkewTooBig"        = "Clock skew too big or service expired.  Please check your time, time zone and daylight savings settings.";
"KLStringPreauthenticationFailed"        = "Password incorrect or preauthentication failed.";
"KLStringEnterPrincipal"                 = "Please enter your principal name";
"KLStringEnterPassword"                  = "Please enter the password for %s";
"KLStringEnterOldPassword"               = "Please enter the old password for %s";
"KLStringEnterNewPassword"               = "Please enter the new password for %s";
"KLStringEnterVerifyPassword"            = "Verifying, please re-enter the new password for %s again";
"KLStringBanner"                         = "Kerberos Login Library: ";
"KLStringNoLifetime"                     = "none";
"KLStringDay"                            = "day";
"KLStringDays"                           = "days";
"KLStringHour"                           = "hour";
"KLStringHours"                          = "hours";
"KLStringMinute"                         = "minute";
"KLStringMinutes"                        = "minutes";
"KLStringSecond"                         = "second";
"KLStringSeconds"                        = "seconds";
"KLStringLifetimeSeparator"              = ", ";
"KLApplicationRequest"                   = "%@ requires that you type your Kerberos password";
"KLUnknownRequest"                       = "Please type your Kerberos password";
"KLHideOptions"                          = "Hide Options";
"KLShowOptions"                          = "Show Options";
"NSHumanReadableCopyright"               = "Copyright 2003 Massachusetts Institute of Technology.";